In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('Tokyo.csv')
data.head()

   DistanceMeters  AltitudeMeters
0        0.000000          578.69
1       75.149749          578.00
2      150.299497          581.94
3      225.449260          584.13
4      257.128913          581.95

In [3]:
data_diff = data.diff()
data['DistanceDiff'] = data_diff['DistanceMeters']
data['AltitudeDiff'] = data_diff['AltitudeMeters']
data.head()

   DistanceMeters  AltitudeMeters  DistanceDiff  AltitudeDiff
0        0.000000          578.69           NaN           NaN
1       75.149749          578.00     75.149749         -0.69
2      150.299497          581.94     75.149749          3.94
3      225.449260          584.13     75.149762          2.19
4      257.128913          581.95     31.679654         -2.18

In [4]:
data['Gradient'] = data['AltitudeDiff'] / data['DistanceDiff']
data.head()

   DistanceMeters  AltitudeMeters  DistanceDiff  AltitudeDiff  Gradient
0        0.000000          578.69           NaN           NaN       NaN
1       75.149749          578.00     75.149749         -0.69 -0.009182
2      150.299497          581.94     75.149749          3.94  0.052429
3      225.449260          584.13     75.149762          2.19  0.029142
4      257.128913          581.95     31.679654         -2.18 -0.068814

In [5]:
data.to_csv('Tokyo.csv')